In [ ]:
import pandas as pd 
from IPython.display import display

In [ ]:
df = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/MASS/biopsy.csv', index_col=0)
display(df.head())

        ID  V1  V2  V3  V4  V5    V6  V7  V8  V9   class
1  1000025   5   1   1   1   2   1.0   3   1   1  benign
2  1002945   5   4   4   5   7  10.0   3   2   1  benign
3  1015425   3   1   1   1   2   2.0   3   1   1  benign
4  1016277   6   8   8   1   3   4.0   3   7   1  benign
5  1017023   4   1   1   3   2   1.0   3   1   1  benign

In [ ]:
df['class'].value_counts()

benign       458
malignant    241
Name: class, dtype: int64

In [ ]:
df = df.drop(columns='ID')
print(df.isna().sum,'\n', 'total NA = ', df.isna().sum().sum())
df.V6 = df.V6.fillna( df.V6.mean() )
print( '\n', 'total NA =' , df.isna().sum().sum() )

<bound method DataFrame.sum of         V1     V2     V3     V4     V5     V6     V7     V8     V9  class
1    False  False  False  False  False  False  False  False  False  False
2    False  False  False  False  False  False  False  False  False  False
3    False  False  False  False  False  False  False  False  False  False
4    False  False  False  False  False  False  False  False  False  False
5    False  False  False  False  False  False  False  False  False  False
..     ...    ...    ...    ...    ...    ...    ...    ...    ...    ...
695  False  False  False  False  False  False  False  False  False  False
696  False  False  False  False  False  False  False  False  False  False
697  False  False  False  False  False  False  False  False  False  False
698  False  False  False  False  False  False  False  False  False  False
699  False  False  False  False  False  False  False  False  False  False

[699 rows x 10 columns]>
 total NA =  16

 total NA = 0

In [ ]:
df['class'] = df['class'].map({'benign': 0, 'malignant': 1})
X = df.drop('class', axis=1)
y = df[['class']]

print(X)
print(10*"--")
print(y)

     V1  V2  V3  V4  V5    V6  V7  V8  V9
1     5   1   1   1   2   1.0   3   1   1
2     5   4   4   5   7  10.0   3   2   1
3     3   1   1   1   2   2.0   3   1   1
4     6   8   8   1   3   4.0   3   7   1
5     4   1   1   3   2   1.0   3   1   1
..   ..  ..  ..  ..  ..   ...  ..  ..  ..
695   3   1   1   1   3   2.0   1   1   1
696   2   1   1   1   2   1.0   1   1   1
697   5  10  10   3   7   3.0   8  10   2
698   4   8   6   4   3   4.0  10   6   1
699   4   8   8   5   4   5.0  10   4   1

[699 rows x 9 columns]
--------------------
     class
1        0
2        0
3        0
4        0
5        0
..     ...
695      0
696      0
697      1
698      1
699      1

[699 rows x 1 columns]

In [ ]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=123)

In [ ]:
display(X_train.head())
display(y_train.head())

     V1  V2  V3  V4  V5    V6  V7  V8  V9
35    3   1   2   1   2   1.0   2   1   1
34    2   1   1   2   2   1.0   3   1   1
286   8  10  10  10   8  10.0  10   7   3
454   4   5   5   8   6  10.0  10   7   1
296   5   5   7   8   6  10.0   7   4   1

     class
35       0
34       0
286      1
454      1
296      1